{
  "backend/main.mo": "Empty Motoko actor placeholder with no methods.",
  "feature_evidence.json": "Machine-generated feature-to-file mapping describing implemented functionality and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference or build tooling.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "HTML entry file containing metadata, SEO tags, social previews, and root mount for the React app.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap.",
  "frontend/src/App.tsx": "Main React app component assembling all sections with smooth-scroll behavior.",
  "frontend/src/components/contact/ContactForm.tsx": "Validated contact form with input fields, error messages, submit handling, and success/error UI states.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with scroll styling, smooth section navigation, and mobile sheet menu.",
  "frontend/src/components/projects/ProjectCard.tsx": "Reusable card component showing project thumbnail, details, tech stack, and optional external links.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with descriptive text and a grid of feature items using SectionShell.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a Contact section with contact details and a contact form inside SectionShell.",
  "frontend/src/components/sections/FooterSection.tsx": "Implements a footer with branding, navigation links, social icons, and a bottom attribution bar.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero area with background visuals, heading, subheading, and CTA buttons.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a grid of project cards sourced from the projects dataset inside SectionShell.",
  "frontend/src/components/sections/SectionShell.tsx": "A reusable layout wrapper that provides consistent section structure with titles and content.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a services grid with cards displaying service info, icons, and tags.",
  "frontend/src/components/sections/SkillsSection.tsx": "Lists categorized skills using badges inside a structured SectionShell layout.",
  "frontend/src/data/projects.ts": "Defines the Project interface and exports an array of sample project metadata.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching when identity changes.",
  "frontend/src/hooks/useContactForm.ts": "Provides a custom React hook managing contact form state, validation, submission simulation, and reset logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider using Dfinity AuthClient, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks interacting with the backend; currently contains no active queries.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode styles, animations, and global typography and focus rules.",
  "frontend/src/main.tsx": "Initializes React app root, wrapping App with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, fonts, radii, shadows, and integrates plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, features, requirements, image needs, and current state tracking for the portfolio website build."
}